Main = {
    map: '',
    mapProp: {},
    chats: [
        {
            title: "бр Шевченко 70",
            coordinates: [
                { lat: 47.10721135744143, lng: 37.555174668304964 },
                { lat: 47.10595313614079, lng: 37.554628127342696 },
                { lat: 47.10546807477313, lng: 37.55600519623088 },
                { lat: 47.10590207725761, lng: 37.55761802788591 },
            ],
            link: "https://t.me/+E8dWsvcMlKQzYjcy"
        },
        {
            title: "пр Мира 10/20",
            coordinates: [
                { lat: 47.09369158242039, lng: 37.55940666728296 },//,
                { lat: 47.09357339072438, lng: 37.559953343021284 },//,
                { lat: 47.092901956324766, lng: 37.55967261764214 },//,
                { lat: 47.09293464808333, lng: 37.55942144230291 },//,
            ],
            link: "https://t.me/+UaI4gNqRtik3YjM6"
        },
        {
            title: "4 больница",
            coordinates: [
                { lat: 47.10950371735909, lng: 37.631456403265176 },//,
                { lat: 47.11223704315821, lng: 37.631811422926745 },//,
                { lat: 47.11205583253289, lng: 37.63584977157704 },//,
                { lat: 47.10926209064606, lng: 37.63553912937317 },//,
            ],
            link: "https://t.me/+3NYGeht4BEhjYjcx"
        },
        {
            title: "Азовстальская 7",
            coordinates: [
                { lat: 47.1019158626743, lng: 37.62777614837634 },//
                { lat: 47.101857438004984, lng: 37.629278185409866 },//
                { lat: 47.10157261682388, lng: 37.62924599890201 },//
                { lat: 47.10165295115743, lng: 37.62776541954038 },//
            ],
            link: "https://t.me/+3NYGeht4BEhjYjcx"
        },
        {
            title: "Азовстальская 13, 15, 17, 19/1, 19/2, 21",
            coordinates: [
                { lat: 47.10246359081581, lng: 37.62977171190159 },//
                { lat: 47.102302924473875, lng: 37.632196428827136 },//
                { lat: 47.10152149489685, lng: 37.6317887330609 },//
                { lat: 47.10092993777622, lng: 37.63238954787431 },//
                { lat: 47.10036028396641, lng: 37.63159561401373 },//
                { lat: 47.101097911454005, lng: 37.62976098306564 },//
            ],
            link: "https://t.me/azovstalskaya1315171921"
        },
        {
            title: "Азовстальская 31",
            coordinates: [
                { lat: 47.10195805286599, lng: 37.63403410128396 },//,
                { lat: 47.101658625995306, lng: 37.63436669519853 },//,
                { lat: 47.10119122458714, lng: 37.63359421900986 },//,
                { lat: 47.101483350948115, lng: 37.6331650655717 },//,
            ],
            link: "https://t.me/+JPlAUI1RnFM1MWMy"
        },
        {
            title: "Азовстальская 41",
            coordinates: [
                { lat: 47.10200709951212, lng: 37.636905321619345 },//,
                { lat: 47.10176888426269, lng: 37.639979952431815 },//,
                { lat: 47.10080240003026, lng: 37.63981497224188 },//,
                { lat: 47.101397946966436, lng: 37.63686032702209 },//,
            ],
            link: "https://t.me/+kd2PpPJUUxo4NDEy"
        },
        {
            title: "Азовстальская 63",
            coordinates: [
                { lat: 47.10138471230725, lng: 37.64645047178639 },//,
                { lat: 47.101349563341664, lng: 37.64693929489079 },//,
                { lat: 47.1010589976707, lng: 37.646894543479824 },//,
                { lat: 47.10108008716792, lng: 37.646481453532445 },//,
            ],
            link: "https://t.me/+rQw9FntEjU9mODAy"
        },
        {
            title: "Гонды д.2 и рядом ",
            coordinates: [
                { lat: 47.12238079137538, lng: 37.56601284537189 },//,
                { lat: 47.12210320893142, lng: 37.567584803632506 },//,
                { lat: 47.12143330400145, lng: 37.567383549460736 },//,
                { lat: 47.121688683118826, lng: 37.56567560865162 },//,
            ],
            link: "https://t.me/+SwaAgv5Il7QxM2Qy"
        },
        {
            title: "Горловская 2, 4, 6",
            coordinates: [
                { lat: 47.103826539409106, lng: 37.66278425925925 },//,
                { lat: 47.10468368955183, lng: 37.66392548240618 },//,
                { lat: 47.10437118849425, lng: 37.66548646579105 },//,
                { lat: 47.10335331518811, lng: 37.664378036412714 },//,
                { lat: 47.10355867715917, lng: 37.66121671712066 },//,
                { lat: 47.10393814828213, lng: 37.66146594976194 },//,
            ],
            link: ""
        },
        {
            title: "Казанцева 25, 27, 29",
            coordinates: [
                { lat: 47.103557647566596, lng: 37.54303717747207 },//,
                { lat: 47.10782812228061, lng: 37.54768468141221 },//,
                { lat: 47.10741690628903, lng: 37.54859869052043 },//,
                { lat: 47.10322021273828, lng: 37.54427651185611 },//,
            ],
            link: "https://t.me/K27TKc6F8k6LkBmMWQy"
        },
        {
            title: "Котляревского 2, 4, 6, 8, 8А",
            coordinates: [
                { lat: 47.10936430252732, lng: 37.554098957627666 },//
                { lat: 47.110598335998496, lng: 37.550150745996675 },//
                { lat: 47.113139332554766, lng: 37.552950972180604 },//
                { lat: 47.1102770519325, lng: 37.555128925879224 },//
            ],
            link: "https://t.me/+SWCkzbFpPJBkODBi"
        },
        {
            title: "Киевская 61, 63, 65",
            coordinates: [{lat:47.12656385321022, lng:37.68764446237999},{lat:47.12615506855014, lng:37.687054376396716},{lat:47.12525719121553, lng:37.687816123756946},{lat:47.12530829033232, lng:37.68863151529747}],
            link: "https://t.me/+i38Z_ElxlJFmNWZh"
        },
        {
            title: "Менделеева д. 21, 23, 25, 27, 29, 31 пер. Киевский, д.16, 24",
            coordinates: [{lat:47.111768130386196, lng:37.641381359264514},{lat:47.11024204731252, lng:37.64128479973998},{lat:47.11007410248333, lng:37.64377925412383},{lat:47.11159288862083, lng:37.64392409341063},],
            link: "https://t.me/+mqPr-N8wHC4wOGQy"
        },
        {
            title: "Куприна 1",
            coordinates: [{lat:47.10086867251508, lng:37.50787940301991},{lat:47.10086136929114, lng:37.506624129200944},{lat:47.100087221871334, lng:37.506581213856705},{lat:47.100050705205625, lng:37.50776138582326},],
            link: "https://t.me/+eVFOhtvotHg5ZDU6"
        },
        {
            title: "Куприна 2",
            coordinates: [{lat:47.10132877360421, lng:37.50594821252919},{lat:47.10142371460389, lng:37.507074740315446},{lat:47.10056193624668, lng:37.50753608026601},{lat:47.10047429698828, lng:37.50601258554555},],
            link: "https://t.me/mariypuolKiyprina"
        },
        {
            title: "Кузбасский переулок",
            coordinates: [{lat:47.11892804217905, lng:37.67144237908555},{lat:47.118475394012556, lng:37.67985378655625},{lat:47.11778911364107, lng:37.6795748368187},{lat:47.11832937765354, lng:37.67135654839707},],
            link: "https://t.me/+aSskSa3445oyZjhi"
        },
        {
            title: "Меотиды",
            coordinates: [{lat:47.09818872492707, lng:37.635236487858045},{lat:47.102234760636705, lng:37.63577292966102},{lat:47.10222015456259, lng:37.63688872861122},{lat:47.098042652905576, lng:37.63633082913612},],
            link: "https://t.me/+ScGgR7dW5ZQwMDk6"
        },
        {
            title: "Слесарная и рядом",
            coordinates: [{lat:47.11653227774056, lng:37.64375995363474},{lat:47.116488471275254, lng:37.64500449861765},{lat:47.11463396449822, lng:37.64475773538828},{lat:47.114758087048614, lng:37.64333080019236},],
            link: "https://t.me/+80wGV4lg0VxlMGFi"
        },
        {
            title: "Парашютная, пилотов, Живописная",
            coordinates: [{lat:47.12614023518764, lng:37.529096179190944},{lat:47.12634462796736, lng:37.532347016516994},{lat:47.12398676353295, lng:37.533301882926295},{lat:47.12424956474398, lng:37.52941804427273},],
            link: "https://t.me/parashutnaya_pilotov"
        },
        {
            title: "Металлургов 47",
            coordinates: [{lat:47.09967110175782, lng:37.54596160141841},{lat:47.09953233721027, lng:37.54634247509853},{lat:47.098670528238586, lng:37.54552171913997},{lat:47.09886772304758, lng:37.545114023369706},],
            link: "https://t.me/+U_DX7qQ5eL04MGQy"
        },
        {
            title: "Металлургов 94, 96, 98, 100",
            coordinates: [{lat:47.10695722613752, lng:37.54983502245473},{lat:47.10852721645102, lng:37.55150335646199},{lat:47.10806352645623, lng:37.553225334649554},{lat:47.10623428479441, lng:37.55151944971608},],
            link: "https://t.me/+Hz_z6bIZadA3MjRi"
        },
        {
            title: "Металлургов 102",
            coordinates: [{lat:47.109557449510156, lng:37.553776311078195},{lat:47.1103460630694, lng:37.554521965184335},{lat:47.11013430687235, lng:37.55517105976594},{lat:47.109407757654, lng:37.55432348171723},],
            link: "https://t.me/+SWCkzbFpPJBkODBi"
        },
        {
            title: "Металлургов 21, 23, 24, 27, 29, 31, 33 ",
            coordinates: [{lat:47.095616935463255, lng:37.543095000376596},{lat:47.09547085638661, lng:37.5444468337201},{lat:47.09139508859198, lng:37.54393184958924},{lat:47.09155578785264, lng:37.54230106650819},],
            link: "https://t.me/+cOa1TG7QH4kyNGMy"
        },
        {
            title: "Шевченко 77-79",
            coordinates: [{lat:47.10844624574617, lng:37.55707131244231},{lat:47.108208924238916, lng:37.55691037990142},{lat:47.108066530826676, lng:37.55751119472075},{lat:47.10824543530891, lng:37.557731135859974},],
            link: "https://t.me/+LXDgwK2VGAE4MWVh"
        },
        {
            title: "Металлургов 98",
            coordinates: [{lat:47.108160794438795, lng:37.550430472856036},{lat:47.10801840089779, lng:37.55080061770009},{lat:47.10690479724626, lng:37.549695547585955},{lat:47.10708735681852, lng:37.54936831808614},],
            link: "https://t.me/+pl5FgM3lEEdjYmJi"
        },
        {
            title: "Шевченко 74",
            coordinates: [{lat:47.10934871809921, lng:37.549484937836915},{lat:47.10911505166204, lng:37.549227445771486},{lat:47.108370233047374, lng:37.55082604234436},{lat:47.108749945800305, lng:37.551121085336},],
            link: "https://t.me/shevchenko74mariupol"
        },
        {
            title: "Меотиды 25",
            coordinates: [{lat:47.10804128727712, lng:37.63767381695703},{lat:47.108026682796115, lng:37.638097605981386},{lat:47.108483070933495, lng:37.638124428071535},{lat:47.1084867220228, lng:37.637609443940676},],
            link: "https://t.me/+kdGl0xOXd2Q1NjBi"
        },
        {
            title: "Шевченко 64",
            coordinates: [{lat:47.10664067481627, lng:37.556667269176785},{lat:47.106388740328235, lng:37.556420505947415},{lat:47.105775329632415, lng:37.557944000667874},{lat:47.106140455898114, lng:37.558147848553006},],
            link: "https://t.me/+Lh4QT0pMbCRkNjNi"
        },
        {
            title: "Хмельницкого 23а, 29",
            coordinates: [{lat:47.095756650570536, lng:37.52778439235815},{lat:47.09568361127394, lng:37.528685614587154},{lat:47.094595313887545, lng:37.52879290294775},{lat:47.09466105060243, lng:37.527666375161495},],
            link: "https://t.me/+6zgBRbnfYlllZjdi"
        },
        {
            title: "Строителей 93",
            coordinates:[{lat:47.092659311027546, lng:37.52292850296872},{lat:47.09264105015071, lng:37.52331474106686},{lat:47.091963567195286, lng:37.52318331282513},{lat:47.092001915517216, lng:37.52286412995236},],
            link: "https://t.me/+R9-DuRnKIgpiODE6"
        },
        {
            title: "Владимирская 5",
            coordinates: [{lat:47.10127058793419, lng:37.64017937453845},{lat:47.101204859378775, lng:37.64062462123492},{lat:47.100277347778594, lng:37.64044759543994},{lat:47.10029925768776, lng:37.640034535251644},],
            link: "https://t.me/+BB8xzTkMuLM2NmZi"
        },
        {
            title: "Строителей 107",
            coordinates: [{lat:47.095087289517174, lng:37.52339551340309},{lat:47.09489373272917, lng:37.5235779036161},{lat:47.09553648463496, lng:37.525181864607006},{lat:47.09573734301451, lng:37.524988745557934},],
            link: "https://t.me/+AqaYyPskh_Q3Mzli"
        },
        {
            title: "Пентагон",
            coordinates: [{lat:47.149484079424546, lng:37.604087615996406},{lat:47.15177514740017, lng:37.60702731707673},{lat:47.14860848596162, lng:37.61297109225373},{lat:47.146098371425495, lng:37.609859729796455},{lat:47.14776206523641, lng:37.60254266360383},],
            link: "https://t.me/MariupolPentagon"
        },
        {
            title: "Строителей 99, 101, 103, 105",
            coordinates: [{lat:47.09468850742201, lng:37.523264422610346},{lat:47.09461546666032, lng:37.525040044978205},{lat:47.09361845024668, lng:37.52491129894549},{lat:47.09286976264662, lng:37.52289964218432},],
            link: "https://t.me/+yit73fNlgAkyMGIy"
        },
        {
            title: "Сеченова 63",
            coordinates: [{lat:47.13084455664011, lng:37.5605112066936},{lat:47.1308044115169, lng:37.56085721165652},{lat:47.13001245152687, lng:37.560591672964044},{lat:47.130103691758094, lng:37.56022152811999},],
            link: "https://t.me/+IhE77Yz-UU5kMGM6"
        },
        {
            title: "Металлургов 109, 113, 117, 119, 121, 123, 123а",
            coordinates: [{lat:47.0977889406145, lng:37.52371953038357},{lat:47.09738723857511, lng:37.52587602643155},{lat:47.096138291058146, lng:37.52625153569363},{lat:47.095612409655544, lng:37.52531812695645},{lat:47.09483818591718, lng:37.525210838595854},{lat:47.09497696269828, lng:37.52325819043301},],
            link: "https://t.me/+O2k_zfXtNoQ1YWEy"
        },
        {
            title: "Переулок строительный 2 переулок Левобережный 3",
            coordinates: [{lat:47.12287841036865, lng:37.6633992807454},{lat:47.1233930722445, lng:37.66346365376176},{lat:47.122933161868694, lng:37.666108311850444},{lat:47.121947626246445, lng:37.66765862866105},{lat:47.121772418002266, lng:37.667326034743205},],
            link: "https://t.me/+5qJM--ULIXs5YzMy"
        },
        {
            title: "Металлургов 71, 73",
            coordinates: [{lat:47.104348976439056, lng:37.5510543795541},{lat:47.104630131418745, lng:37.55138697347195},{lat:47.1042978571923, lng:37.55204679688961},{lat:47.10335579371435, lng:37.55229892453701},{lat:47.10334483938982, lng:37.55177857598812},],
            link: "https://t.me/+gGvr2R42brswNTI0"
        },
        {
            title: "Победы 51/32",
            coordinates: [{lat:47.106984893550155, lng:37.63965691804834},{lat:47.106922823246336, lng:37.64080490350671},{lat:47.10661977307668, lng:37.640713708400206},{lat:47.10666723887988, lng:37.6396676468844},],
            link: "https://t.me/+B68vuoYzfeJmMzAy"
        },
        {
            title: "Победы 51/32",
            coordinates: [{lat:47.106984893550155, lng:37.63965691804834},{lat:47.106922823246336, lng:37.64080490350671},{lat:47.10661977307668, lng:37.640713708400206},{lat:47.10666723887988, lng:37.6396676468844},],
            link: "https://t.me/+B68vuoYzfeJmMzAy"
        },
        {
            title: "Гастелло 87",
            coordinates: [{lat:47.12841359636909, lng:37.563042688296456},{lat:47.128260307820454, lng:37.56415312282862},{lat:47.12799387667277, lng:37.56409947864832},{lat:47.128143516248755, lng:37.56298367969813},],
            link: "https://t.me/+ua5c9twLUFhjM2Qy"
        },
        {
            title: "Победы 105, 103, 107/21, Межевая 19,15",
            coordinates: [{lat:47.10588704007526, lng:37.65888874247423},{lat:47.10562779945029, lng:37.66351823523394},{lat:47.105240761801575, lng:37.66348604872576},{lat:47.10555477369422, lng:37.658813640621815},],
            link: "https://t.me/+gx-gwA2by644ZTAy"
        },
        {
            title: "Левый берег частный сектор. Халвацех",
            coordinates: [{lat:47.10044226038562, lng:37.660667946629005},{lat:47.10003327502615, lng:37.66753440170713},{lat:47.09562187611082, lng:37.66757731705137},{lat:47.095738739072786, lng:37.662384560398536},],
            link: "https://t.me/+CBeI5NWad0ZkYmMy"
        },
        {
            title: "Улица Салтыкова-Щедрина",
            coordinates:[{lat:47.114608057786505, lng:37.65250303128501},{lat:47.113133166958676, lng:37.652331369908055},{lat:47.11282650135643, lng:37.663296240360935},{lat:47.11395093325868, lng:37.663274782688816},],
            link: "https://t.me/+i-myWEeqcp03ZjVi"
        },
        {
            title: "Проспект победы",
            coordinates:[{lat:47.10885902540476, lng:37.61725207488396},{lat:47.108216434322166, lng:37.61699458281853},{lat:47.10517862600297, lng:37.668235503839036},{lat:47.105938094335855, lng:37.66806384246208},],
            link: "https://t.me/prospectPobedi"
        },
        {
            title: "130й таганрогской дивизии 38-97",
            coordinates:[{lat:47.11690441066924, lng:37.66965852523959},{lat:47.1167948952042, lng:37.67069922233737},{lat:47.11340710549481, lng:37.670291526567105},{lat:47.11350932644336, lng:37.66921864296115},],
            link: "https://t.me/+83eqy7bbMihlMzc0"
        },
        {
            title: "Морской бульвар, д.6",
            coordinates:[{lat:47.098613580237505, lng:37.627929613262864},{lat:47.098591669634644, lng:37.629034683377},{lat:47.098325089911135, lng:37.62902395454094},{lat:47.09831048276444, lng:37.62786524024651},],
            link: "https://t.me/+int_N5VZ2Ac1Y2Vi"
        },
        {
            title: "пр.Мира 143, 127",
            coordinates:[{lat:47.10075725273429, lng:37.5095108017049},{lat:47.100669613797386, lng:37.51103429642536},{lat:47.099738441183554, lng:37.51151709404804},{lat:47.09977130637658, lng:37.50971464959003},],
            link: "https://t.me/+D6A3FCymVHYwM2Jk"
        },
        {
            title: "Артема",
            coordinates:[{lat:47.09689277015862, lng:37.55005118039396},{lat:47.09677590972932, lng:37.550351587803625},{lat:47.106328403329094, lng:37.55975004819181},{lat:47.106532872221976, lng:37.559320894749426},],
            link: "https://t.me/artema_kuindzhi"
        },
        {
            title: "Ильичовский р-он,20 шк.,остановка 3 проходная",
            coordinates:[{lat:47.138172055397824, lng:37.57834180043026},{lat:47.13631830444586, lng:37.577419120529136},{lat:47.1357490293723, lng:37.581206399658164},{lat:47.13754441467408, lng:37.58181794331356},],
            link: "https://t.me/+5yJZJHWFtRQ2MmQy"
        },
        {
            title: "Мариуполь Кронштадтская Chat",
            coordinates:[{lat:47.08365217169633, lng:37.50919402252405},{lat:47.08384211656147, lng:37.5094729722616},{lat:47.07975815271154, lng:37.517015344011476},{lat:47.07953896869826, lng:37.51685441147058},],
            link: "https://t.me/+ooUT61cOOFZjMDcy"
        },
        {
            title: "Морской 20",
            coordinates:[{lat:47.09958475734188, lng:37.63064872727518},{lat:47.09957745394179, lng:37.63215612874155},{lat:47.09930357571616, lng:37.63215612874155},{lat:47.09929262055785, lng:37.63063799843912},],
            link: "https://t.me/+ZPLyCLn2RItmNWMy"
        },
        {
            title: "Металлургов 77-79",
            coordinates:[{lat:47.10643800830632, lng:37.55241182355518},{lat:47.10631751758903, lng:37.55269077329273},{lat:47.104875259045016, lng:37.55129066018696},{lat:47.1049847990398, lng:37.55095806626911},],
            link: "https://t.me/metallurgov79"
        },
        {
            title: "Металлургов 89-91",
            coordinates:[{lat:47.10660915862223, lng:37.554654632908424},{lat:47.10648866829235, lng:37.55492285380991},{lat:47.10605417059531, lng:37.55450442920359},{lat:47.10558315648058, lng:37.553345714909156},{lat:47.10589351508653, lng:37.55321696887644},{lat:47.106265943025136, lng:37.55425230155619},],
            link: "https://t.me/+pXcHW7mIqJFiNzMy"
        },
        {
            title: "Белинского. Левый берег",
            coordinates:[{lat:47.11438599668913, lng:37.64559056105819},{lat:47.11447361304537, lng:37.644796627189784},{lat:47.120431186848776, lng:37.64556910338607},{lat:47.12054799535369, lng:37.64636303725448},],
            link: "https://t.me/+p69sHyUFZ5VhYzFi"
        },
        {
            title: "Красномаякская 50, 48",
            coordinates:[{lat:47.07306498043329, lng:37.510923063789214},{lat:47.073528975231625, lng:37.51152924302658},{lat:47.073225734994, lng:37.512119329009856},{lat:47.07271058798431, lng:37.51152387860855},],
            link: "https://t.me/primorskiypark"
        },
        {
            title: "б-р Шевченко 258",
            coordinates:[{lat:47.11602046211338, lng:37.517103820507245},{lat:47.11556778921202, lng:37.517071633999066},{lat:47.11544366855024, lng:37.51848784035893},{lat:47.115881740181834, lng:37.51850929803105},],
            link: "https://t.me/+e2RIJPDG-og4MGEy"
        },
        {
            title: "Родниковая, Джерельна (бывшая Кустоовражная)",
            coordinates:[{lat:47.071283174298195, lng:37.47062886334882},{lat:47.071517006771316, lng:37.473289614691595},{lat:47.06456005195399, lng:37.47496331311689},{lat:47.06456005195399, lng:37.472302561774114},],
            link: "https://t.me/+SSFS5UbKRKo0MDgy"
        },
        {
            title: "Мира 87А",
            coordinates:[{lat:47.0978898202221, lng:37.53681166294768},{lat:47.097875212955984, lng:37.53790600422575},{lat:47.09753924472932, lng:37.53799719933226},{lat:47.09765245165118, lng:37.53668828133299},],
            link: "https://t.me/mariupolmira87a"
        }



    ],
    init: function(){
        this.myMap();
    },
    myMap: function () {
        let self = this;
        self.mapProp = {
            center:new google.maps.LatLng(47.1193857410282, 37.56049021240345),
            zoom:13,
        };
        self.map = new google.maps.Map(document.getElementById("googleMap"), this.mapProp);

        // Create the search box and link it to the UI element.
        const input = document.getElementById("pac-input");
        const searchBox = new google.maps.places.SearchBox(input);

        self.map.controls[google.maps.ControlPosition.TOP_LEFT].push(input);
        // Bias the SearchBox results towards current map's viewport.
        self.map.addListener("bounds_changed", () => {
            searchBox.setBounds(self.map.getBounds());
        });

        let markers = [];

        // Listen for the event fired when the user selects a prediction and retrieve
        // more details for that place.
        searchBox.addListener("places_changed", () => {
            const places = searchBox.getPlaces();

            if (places.length == 0) {
                return;
            }

            // Clear out the old markers.
            markers.forEach((marker) => {
                marker.setMap(null);
            });
            markers = [];

            // For each place, get the icon, name and location.
            const bounds = new google.maps.LatLngBounds();

            places.forEach((place) => {
                if (!place.geometry || !place.geometry.location) {
                    console.log("Returned place contains no geometry");
                    return;
                }

                const icon = {
                    url: place.icon,
                    size: new google.maps.Size(71, 71),
                    origin: new google.maps.Point(0, 0),
                    anchor: new google.maps.Point(17, 34),
                    scaledSize: new google.maps.Size(25, 25),
                };

                let myMap = self.map;
                // Create a marker for each place.
                markers.push(
                    new google.maps.Marker({
                        myMap,
                        icon,
                        title: place.name,
                        position: place.geometry.location,
                    })
                );
                if (place.geometry.viewport) {
                    // Only geocodes have viewport.
                    bounds.union(place.geometry.viewport);
                } else {
                    bounds.extend(place.geometry.location);
                }
            });
            self.map.fitBounds(bounds);
        });


        this.chats.forEach(function (chat) {
            self.setChat(chat.title, chat.coordinates, chat.link);
        });
    },
    setChat: function (title, coordinates, link) {
        let chatPolygon = new google.maps.Polygon({
            paths: coordinates,
            strokeColor: "#FF0000",
            strokeOpacity: 0.8,
            strokeWeight: 2,
            fillColor: "#FF0000",
            fillOpacity: 0.35,
        });

        chatPolygon.setMap(this.map);
        google.maps.event.addListener(chatPolygon, 'click', function (object) {
            window.open(link,'_blank');
        });

    }
};
